# suppress inspection "SpellCheckingInspection" for whole file
About=Sobre
About.Hash.Checker=Sobre o Verificador Hash
All=Todos
Algorithm=Algoritmo
Calculated.Hash=Hash Calculado
Click.to.open.file.to.check=Clique para abrir o arquivo para verificar
Click.to.open.hash.file=Clique para abrir o arquivo hash
Developer=Desenvolvedor
File=Arquivo
File.to.be.checked=Arquivo para ser verificado
File.with.official.hashes=Arquivo com os hashes oficiais
Github.Account=Conta no Github
Hash=Hash
Hash.Checker=Verificador Hash
Hash.Checker.Manual=Manual do Verificador Hash
Hash.Checker.Report=Relat\u00F3rio do Verificador Hash
Hash.Files=Arquivos Hash
Help=Ajuda
How.To.Use=Como Usar
Information=Informa\u00E7\u00E3o
Language=Idioma
Manual=Manual
Official.Hash=Hash Oficial
Open=Abrir
Open.File.to.Check=Abrir Arquivo para Verificar
Open.Hash.File=Abrir Arquivo Hash
Operation=Opera\u00E7\u00E3o
pane.how.to.use.content=Exceto pela abertura dos arquivos, todas as demais fun\u00E7\u00F5es s\u00E3o autom\u00E1ticas. Assim que ambos os arquivos forem abertos, o programa automaticamente iniciar\u00E1 o processo de verifica\u00E7\u00E3o. Ao terminar, os resultados ser\u00E3o apresentados em uma tabela em um nova janela.
pane.information-content=Hash Checker \u00E9 um programa para verificar integridade de arquivos. Para isso ele calcula a somat\u00F3ria hash do arquivo e compara com as somat\u00F3rias oficiais contidas em outro arquivo.
pane.language.content=No momento em que o programa \u00E9 executado, ele tenta usar o mesmo idioma do sistema operacional, caso isso falhe, o idioma padr\u00E3o \u2013 ingl\u00EAs \u2013 ser\u00E1 usado no lugar. O idioma pode ser alterado a qualquer momento na janela principal. Todas as demais janelas ser\u00E3o atualizadas quando o idioma for alterado.
pane.operation.content.1=Depois de ambos os arquivos abertos, o programa analisa o arquivo oficial, filtrando apenas os hashes v\u00E1lidos. Com base neles, o programa determina quais algoritmos devem ser usados para testar o arquivo.
pane.operation.content.2=Ap\u00F3s a an\u00E1lise, o programa separa cada algoritmo em uma thread. Dessa forma aumentando o desempenho, especialmente em processadores com m\u00FAltiplos n\u00FAcleos.
pane.operation.content.3=Assim que as threads forem finalizando, os resultados ser\u00E3o armazenados. Quando todas as threads terminarem, os resultados ser\u00E3o comparados com os dados oficiais, depois organizados e exibidos em formato de tabela em uma nova janela.
pane.operation.content.4=Quando essa janela de relat\u00F3rio for fechada, o programa estar\u00E1 pronto para iniciar uma nova tarefa.
Risk=Em Risco
Secure=Seguro
Settings=Configura\u00E7\u00F5es
Source.code=C\u00F3digo fonte
Status=Estado
Supported.Encryptions=Criptografias Suportadas
Title=T\u00EDtulo
Version=Vers\u00E3o